import { createSlice } from "@reduxjs/toolkit";
import img1 from "../../assets/Images/thumb1.webp";
import img2 from "../../assets/Images/thumb2.jpg";
import img3 from "../../assets/Images/thumb3.webp";
import img4 from "../../assets/Images/thumb4.webp";
import img5 from "../../assets/Images/thumb5.webp";
import img6 from "../../assets/Images/thumb6.webp";
import img7 from "../../assets/Images/thumb7.webp";
import img8 from "../../assets/Images/thumb8.webp";
const initialState = JSON.parse(localStorage.getItem("products")) ?? [
  {
    productId: 1,
    productCategory: "Laptop",
    product: "fujitsu UH-552",
    productPrice: 27000000,
    desc: " طراحی و ساختبه دلیل بدنه باریک و وزن کم، اصولا کاربرانی به سمت آلترابوک‌ها می روند که دستگاه خود را زیاد جابجا می‌کنند. بنابراین کمپانی‌های مختلف، معمولا سعی می‌کنند تا آلترابوک‌هایی وارد بازار کنند که بهترین ارگونومی را داشته باشد. UH552 نیز از این قاعده مستثنا نیست. ضخامت دستگاه تنها 18 میلی‌متر بوده و وزن آن نزدیک به 1.6 کیلوگرم می‌باشد که برای یک آلترابوک 13.3 اینچی بسیار خوب است. لبه‌ها نیز کمی انحنا داشته که تمامی این‌ها در کنار یکدیگر باعث می‌شوند تا حمل‌ونقل و جابجایی UH552 بسیار راحت و لذت‌بخش باشد.قاب پشت صفحه نمایش و قسمت زیرین دستگاه دارای یک روکش از جنس آلومینیوم برس خورده است. این روکش نه تنها ظاهر فوق‌العاده زیبا و جذابی به UH552 داده، بلکه باعث شده است تا بدنه خارجی این آلترابوک، مقاومت بسیار خوبی در برابر اثر انگشت و گرد و غبار داشته باشد. ولی هنگامی که لپ‌تاپ را باز می‌کنید، با شرایط کاملا متفاوتی مواجه می‌شوید. فضای اطراف کیبورد و استراحتگاه دست، از پلاستیک براق ساخته‌شده و استعداد بالایی در جذب اثر انگشت دارد.کیفیت ساخت نیز عالیست و با وجود ضخامت باریک 18 میلی‌متری، بدنه می‌تواند ضربات وارده در مصارف روزانه را تحمل کرده و تحت فشار دچار فرورفتگی نشود. لولاها نیز بسیار مستحکم می‌باشند و امکان باز کردن دستگاه تا زاویه 145 درجه‌ای را فراهم می‌نمایند.• صفحه نمایشیکی از مشخصه‌های اصلی لپ‌تاپ‌های ارزان‌قیمت، استفاده از پنل‌های TN با دقت پایین است. متاسفانه، UH552 نیز قربانی این رویه شده است. صفحه نمایش 13.3 اینچی این آلترابوک از پنل TN استفاده کرده و دارای دقت 1366×768 می‌باشد. کیفیت رنگ‌ها و کنتراست این صفحه، ضعیف تر از انتظار ما بود و به همین دلیل UH552 را دستگاه مناسبی برای گرافیست‌ها و طراحان نمی‌دانیم.جدا از کنتراست و کیفیت رنگ‌های تولیدشده، یکی از مزایای اصلی UH552، روکش ماتیست که فوجیتسو بر روی صفحه نمایش این مدل قرار داده است. این روکش مات کمک می‌کند تا بتوانید با دستگاه خود در فضاهای خارجی و در زیر تابش نور آفتاب نیز کار کنید.زوایای دید نیز همان طور که از یک صفحه نمایش با پنل TN انتظار داشتیم، بسیار محدود است و اگر کمی از بالا و یا پایین به صفحه نمایش نگاه کنید، افت زیادی در کیفیت تصویر و رنگ‌های تولیدشده مشاهده خواهید نمود.در بالای صفحه نمایش، یک وب کم HD تعبیه شده است که تفاوت خاصی با وب کم لپ‌تاپ‌های رقیب نداشته و در شرایط نوری مناسب می‌توان تماس‌های تصویری خوبی با آن برقرار کرد.• کیبورد و تاچ پدهمانند اکثر لپ‌تاپ‌های مدرن، UH552 نیز از یک کیبورد جزیره‌ای با کلیدهای جدا از هم استفاده می‌کند. با وجود ضخامت پایین دستگاه، کلیدها آستانه و عمق مناسبی داشته و تایپ کردن با آن‌ها لذت‌بخش است. به دلیل ابعاد کوچک، کیبورد این آلترابوک‌ها دارای بخش عددی جداگانه نمی‌باشد. کلیدهای اصلی مانند Enter و Shift دارای ابعاد بزرگ‌تری هستند و به همین دلیل خطاهای تایپی با کیبورد UH552 بسیار کم خواهد بود.همان طور که از یک محصول در این بازه قیمتی انتظار می‌رفت، کیبورد UH552 به نور پس زمینه مجهز نشده است.در پایین کلید Space، تاچ پد قرار دارد که با توجه به ابعاد کوچک دستگاه، به اندازه‌ی کافی بزرگ است. سطح تاچ پد از همان جنس استفاده شده در استراحت گاه دست بهره می‌برد. حساسیت تاچ پد خوب بوده و به تمامی لمس‌ها پاسخ می‌دهد. کلیدهای چپ و راست نیز در کل تاچ پد به صورت یکپارچه تعبیه شده‌اند و عملکرد مناسبی دارند.• بلندگوهادر بالای کیبورد، یک صفحه مشبک وجود دارد که در زیر آن، بلندگوهای استریوی UH552 قرار داده شده‌اند. متاسفانه عملکرد این بلندگوها رضایت‌بخش نیست. بلندی صدا کم بوده و کیفیت آن نیز پایین است. به همین دلیل استفاده از هدفون و یا بلندگوهای خارجی را به کاربران UH552 پیشنهاد می‌کنیم.• پورت‌ها و اتصالاتتمامی پورت‌ها و اتصالات UH552 بر روی دو لبه کناری دستگاه تعبیه شده‌اند. بر روی لبه سمت چپی به ترتیب قفل Kensington، خروجی تصویری HDMI، دو عدد پورت USB 3.0 و ورودی 3.5 میلی‌متری هدفون تعبیه شده‌اند. لبه سمت راستی نیز محل قرارگیری کارت خوان و یک پورت USB 2.0 می‌باشد.اما دو نکته مهم در مورد پورت‌های این دستگاه است که نیاز به اشاره دارد:1. این دستگاه پورت شبکه LAN ندارد و برای استفاده از شبکه‌های با سیم، باید از مبدل‌های USB به RJ45 استفاده نمایید.2. برخی مدل‌های سری UH552 بر روی لبه سمت راستی دارای یک شیار سیم‌کارت نیز می‌باشند که از شبکه‌های جهانی UMTS پشتیبانی می‌کند و به کمک آن می‌توانید حتی زمانی که به W-Fi دسترسی ندارید، از اینترنت سیم‌کارت خود استفاده کنید.• عملکرد سخت‌افزاری و باتریتمامی مدل‌های UH552 از نسل سوم پردازنده ولتاژ پایین و دو هسته‌ای Intel Core i3 و Intel Core i5 استفاده می‌کنند. این پردازنده‌های رده متوسط، قدرت کافی برای انجام کلیه کارهای عادی روزمره (مانند مرورگری اینترنت، تماشای ویدئو و کار با نرم‌افزارهای آفیس) را فراهم می‌کنند، اما نباید انتظار انجام محاسبات سنگین (مانند برنامه‌نویسی و ویرایش عکس و ویدئو) را از چنین پردازنده‌هایی داشته باشید. به علاوه، تمامی این آلترابوک‌ها از پردازشگرهای گرافیکی Intel HD Graphics 4000 استفاده می‌کنند، بنابراین مناسب اجرای بازی‌های کامپیوتری و یا کارهای گرافیکی سنگین نمی‌باشند.همانند اکثر آلترابوک ها، UH552 سیستم خنک‌کننده بهینه‌ای ندارد. در حالت بیکار و هنگامی که بار محاسباتی سنگینی بر روی دستگاه نیست، دمای اکثر قسمت‌های بدنه خنک بوده و فن دستگاه، صدای زیادی تولید نمی‌کند. ولی تحت استرس زیاد، دمای قسمت‌های مختلف، به خصوص بخش زیرین دستگاه، به لطف روکش آلومینیومی، بسیار گرم شده و صدای فن خنک‌کننده نیز کمی آزاردهنده می‌شود. در این حالت، امکان اینکه بتوانید دستگاه را بر روی پاهای خود قرار داده و با آن کار کنید، تقریبا غیرممکن است.تمامی مدل‌های UH552 از باتری‌های داخلی غیرقابل تعویض با ظرفیت 2840 میلی آمپرساعت استفاده می‌کنند. طبق ادعای فوجیتسو، این باتری باید بتواند تا 7 ساعت و نیم شارژدهی کند ولی در واقعیت، عملکرد این باتری چندان رضایت‌بخش نیست. در تست استاندارد مرورگری اینترنت از طریق Wi-Fi و با روشنایی متوسط صفحه نمایش، مدل‌های مختلف UH552 بسته به نوع پردازشگر، توانستند بین 3:00 تا 3:30 شارژدهی کنند که برای یک آلترابوک با پردازنده کم مصرف، پایین تر از حد انتظار است.• جمع‌بندیبر خلاف گوشی‌های موبایل که هر سال با معرفی مدل‌های جدیدتر، به سمت بزرگ‌تر شدن می روند، لپ‌تاپ‌ها و آلترابوک ها، هر سال باریک‌تر، سبک‌تر و کوچک‌تر می‌شوند، اما با وجود قیمت بالای آلترابوک ها، امکان تهیه آن‌ها برای همگان وجود ندارد. فوجیتسو با تولید Lifebook UH552، توانست محصولی بینابین وارد بازار کند. یعنی یک آلترابوک با بدنه‌ای باکیفیت، سبک و باریک، بدون امکانات لوکس آلترابوک‌های رده‌بالا ولی با قیمتی بسیار مناسب. پس اگر به دنبال یک کامپیوتر شخصی قابل حمل‌ونقل بوده و بتوانید از معایب اصلی این دستگاه (کیفیت متوسط صفحه نمایش، شارژدهی ضعیف باتری و ...) چشم‌پوشی کنید، Lifebook UH552 انتخاب خیلی خوبی برای شما خواهد بود.",
    img: img1,
    like: false,
  },
  {
    productId: 2,
    productCategory: "Laptop",
    product: "VivoBook Pro 15 OLED K3500PH-L1167",
    productPrice: 28000000,
    desc: "سری VivoBook لپ‌تاپ‌های شرکت ایسوس با توجه به بهره بردن از مشخصات فنی مناسب و قیمت مقرون به‌صرفه، طرفداران بسیاری در بین کاربران دارند. یکی از لپ‌تاپ‌های با‌کیفیت این سری، لپ‌تاپ VivoBook Pro 15 OLED K3500PH-L1167 است. پیش از اینکه به مشخصات فنی در نظر گرفته شده به این لپ‌تاپ بپردازیم، باید بگوییم که با توجه به قیمت در نظر گرفته شده و قیمت مقرون به‌صرفه، باید گفت که توانایی ارائه عملکرد قابل قبولی را دارد. این لپ‌تاپ به صفحه‌نمایش با ابعاد 15.6 اینچ و رزولوشن 1080×1920 پیکسل مجهز شده است. صفحه‌نمایشی که توانایی ارائه نرخ بروزرسانی 60 هرتز را دارد. در بخش مشخصات سخت‌افزاری هم مشخصات مناسب و قابل قبولی برای این لپ‌تاپ میان‌رده در نظر گرفته شده است. پردازنده مدل 11300H سری Core i5 شرکت اینتل این لپ‌تاپ را همراهی می‌کند که توانایی ارائه حداکثر فرکانس کاری 4.4 گیگاهرتز را دارد. پردازنده گرافیکی GeForce GTX1650 MAX-Q Desin هم این لپ‌تاپ میان‌رده را همراهی می کند. باتری سه سلولی در نظر گرفته شده برای این لپ‌تاپ میان‌رده هم به ازای هر بار شارژ 100 درصدی، توانایی ارائه طول عمر مفید (زمان آماده به‌کار) یک الی سه ساعت را دارد. در مجموع به عنوان یک لپ‌تاپ میان‌رده با قیمتی مقرون به‌صرفه، لپ‌تاپ VivoBook Pro 15 OLED K3500PH-L1167 توانایی ارائه عملکرد قابل قبولی را دارد.",
    img: img2,
    like: false,
  },
  {
    productId: 3,
    productCategory: "Laptop",
    product: "ZenBook 14 OLED UX3402ZA-KM101W",
    productPrice: 29000000,
    desc: "ما لپ‌تاپ Zenbook 14 OLED را با ۳۲ گیگابایت رم پرسرعت LPDDR5X-7467 از شرکت SK Hynix و یک ترابایت SSD با رابط ۴ مسیره‌ی PCIe Gen 4.0 ساخت شرکت سن‌دیسک برای بررسی دراختیار داشتیم. سرعت خواندن و نوشتن SSD دستگاه را به‌ترتیب ۴۹۶۴٫۶۹ و ۳۲۹۲٫۹۹ مگابایت‌برثانیه به‌دست آوردیم که به نسبت برچسب قیمتی محصول و رابط PCIe Gen 4.0 خود SSD، سرعت چندان مطلوبی نیست.اجازه بدهید کمی راجع‌به مشخصات فنی پردازنده‌ای صحبت کنیم که قدرت پردازشی Zenbook 14 OLED را تأمین می‌کند. پردازنده‌ی Core Ultra 7 155H را می‌توان به‌نوعی نسخه‌ای تضعیف‌شده از Core Ultra 9 185H، بالارده‌ترین عضو از خانواده‌ی نسل چهاردهمی میتیورلیک دانست؛ چرا که تمام مشخصات فنی از تعداد هسته‌ها گرفته تا واحد پردازش گرافیکی‌شان یکسان است، صرفا هسته‌های Core Ultra 7 با فرکانس بسیار پایین‌تری کار می‌کنند؛ تفاوتی که به کاهش مصرف تراشه نیز می‌انجامد.",
    img: img3,
    like: false,
  },
  {
    productId: 4,
    productCategory: "Laptop",
    product: "ThinkBook 15 G2 ITL-i5 1135G7 12GB 1HDD 256SSD MX450",
    productPrice: 36000000,
    desc: "لپ تاپ ThinkBook 15 جزء سری‌های میان‌رده شرکت لنوو قرار دارد که در سال 2021 رونمایی شده و مجهز به پردازنده‌های نسل 11 شرکت اینتل است. این لپ‌تاپ با تلفیقی از دو سری ThinkPad و IdeaPad ساخته شده است یعنی در کنار ظرافت و زیبایی به ارث برده از سری IdeaPad، استحکام سری ThinkPad را نیز یدک می‌کشد. استفاده از ترکیب فلز و پلاستیک بسیار باکیفیت باعث شده تا ضخامت این لپ‌تاپ 18.9 میلی‌متر و و وزن آن 1.7Kg باشد که اعدادی فوق‌العاده برای یک لپ‌تاپ 15.6 اینچ محسوب می‌شوند. تفاوت این‌لپ تا با سری ThinkBook 15 در طراحی قاب‌پشتی و پردازنده جدیدتر است. این لپ‌تاپ دارای حافظه 1 ترابایت هاردیسک به همراه 256 گیگابایت حافظه از نوع SSD (درایو حالت جامد) (Solid State Drive) بوده و می‌تواند ظرفیت ذخیره‌سازی بالایی را به شما هدیه دهد. لپ تاپ 15.6 اینچی لنوو مدل ThinkBook 15 با پردازنده مرکزی i5 مناسب مصارف روزمره و عمومی و سطح بالا است. ThinkBook 15 دارای کیفیت تصویر Full HD بوده و درون خود یک رم 12 گیگاباتی را یدک می‌کشد.",
    img: img4,
    like: false,
  },
  {
    productId: 5,
    productCategory: "Laptop",
    product: "TUF Gaming F15 FX506LH-US53",
    productPrice: 21000000,
    desc: "سری TUF لپ‌تاپ‌های ایسوس تا به‌ امروز توانسته‌اند با بهره بردن از مشخصات فنی مناسب، عملکرد بسیار خوب و قابل‌قبولی داشته باشند. در میان محصولات این سری، ایسوس سعی داشته تا برخی از لپ‌تاپ‌ها را با قیمت‌های اقتصادی‌تری روانه بازار کند. TUF Gaming F15 FX506LH-US53 یکی از لپ‌تاپ‌های مقرون‌به‌صرفه این شرکت است که از مشخصات فنی مناسب و قابل قبولی بهره برده است. این لپ‌تاپ دارای وزن 2.3 کیلوگرم و ضخامت 2.4 سانتی‌متر است. صفحه‌نمایش 15.6 اینچی این لپ‌تاپ با رزولوشن 1080×1920 پیکسل، توانایی ارائه نرخ بروزرسانی 60 هرتز را دارد. پردازنده به‌کار رفته در این مدل سری Core i5 اینتل است. پردازنده گرافیکی این لپ‌تاپ GEFORCE GTX1650 است که می‌تواند باعث توانایی ارائه عملکرد کاملا خوب و قابل قبولی شود. 8 گیگابایت حافظه رم از نوع DDR4 در کنار 512 گیگابایت حافظه داخلی از نوع SSD، از دیگر مشخصات فنی در نظر گرفته شده برای لپ‌تاپ Gaming F15 FX506LH-US53 ایسوس است.",
    img: img5,
    like: false,
  },
  {
    productId: 6,
    productCategory: "Laptop",
    product: "Omen 16-K0033DX-i9 16GB 1SSD RTX3060",
    productPrice: 27000000,
    desc: "لپ تاپ‌های سری Omen شرکت اچ پی از محصولات پرفروش گیمینگ هستند. لپ تاپ مدل Omen 16-K0033DX i9 16 1 RTX3060 6 را می‌توان یکی از پرطرفدارترین لپ تاپ‌های این شرکت لقب داد که هم نظر سخت افزار و هم از نظر ظاهری می‌تواند گزینه‌ای جذاب برای گیمرها باشد. این لپ تاپ به پردازنده‌ی بسیار قدرتمند Core i9 12900H شرکت اینتل با 14 هسته و 20 رشته و همچنین فرکانس نهایی 5.0 گیگاهرتز مجهز شده است. علاوه بر این، 16 گیگابایت رم از نوع DDR5 با سرعت 4800 مگاهرتز برای این لپ تاپ در نظر گرفته شده است. لازم به ذکر است که یک ترابایت حافظه‌ی ذخیره‌سازی SSD PCIe NVMe این لپ تاپ می‌تواند از نظر فضای ذخیره‌سازی و سرعت عملکرد فوق‌العاده‌ای داشته باشد. شرکت اچ‌پی برای این لپ تاپ از پردازنده‌ی گرافیکی GeForce RTX 3060 انویدیا و نمایشگر 16 اینچی استفاده کرده است.",
    img: img6,
    like: false,
  },
  {
    productId: 7,
    productCategory: "Laptop",
    product: "ASPIRE 5 A515-56G-59PV",
    productPrice: 25000000,
    desc: "لپ تاپ ایسر Aspire 5 A515-56-511A یک دستگاه میان رده است ، و جزو دستگاه هایی محسوب می شود که دمای بسیار پایینی دارد و پردازنده آن به سختی داغ می شود . علاوه بر این به دلیل پایین بودن دما پردازنده نویز بسیار کمی دارد ، چون دور فن ها بالا نمی رود .صفحه کلید این لپ تاپ نور پس زمینه دارد و عمر باتری نیز به لطف کم مصرف بودن پردازنده دوام خوبی دارد و میتوانید از باتری لپ تاپ حداکثر استفاده را ببرید .  از رقبای لپ تاپ Aspire 5 A515 میتوان به لنوو V15 ، لنوو آیدیاپد 3 و حتی dell 3505 اشاره کرد .لپ تاپ های سری Aspire 5 ایسر تنوع بسیار زیادی دارند و با پردازنده اینتل و AMD در دسترس هستند .  لپ تاپ Aspire 5 A515-56-511A با صفحه نمایش 15.6 اینچ عرضه شده ، چند نسخه از لپ تاپ های اسپایر ایسر را در گذشته آنباکس و بررسی کرده ایم که شما میتوانید از طریق کانال آپارات و یوتیوب تکنوکده آنباکس این لپ تاپ ها را مشاهده نمایید .",
    img: img7,
    like: false,
  },
  {
    productId: 8,
    productCategory: "laptop",
    product: "Raider GE78HX 13VH-i9 13950HX 32GB 2SSD RTX4080",
    productPrice: 37000000,
    desc: "لپ تاپ Raider GE78HX 13VH با مشخصات فنی، کیفیت ساخت و امکانات شگفت‌انگیز خود به راحتی می‌تواند دارندگانش را چندین و چند سال از خرید دستگاه جدید و ارتقا دستگاه خود بی‌نیاز کند. این لپ تاپ به واسطه‌ی بهره‌مندی از قدرتمندترین پردازنده مرکزی لپ تاپی موجود در بازار یعنی Core i9 13950HX که از 24 هسته و 32 رشته بهره‌مند است، به راحتی می‌تواند سنگین‌ترین بازی‌ها و پردازش‌ها را انجام دهد. همچنین، مجهز شدن آن به قدرتمندترین پردازنده گرافیکی موبایلی انویدیا یعنی GeForce RTX 4080 می‌تواند این لپ تاپ را به گزینه‌ی رویایی گیمرها و علاقه‌مندان به بازی‌های ویدیویی تبدیل کند. در کنار موارد ذکر شده، صفحه نمایش با نرخ 240 هرتز و وضوح 1600p به همراه دو ترابایت حافظه‌ی ذخیره‌سازی پر سرعت M.2 SSD و همچنین 32 گیگابایت رم DDR5 با سرعت 5600 مگاهرتز، از ویژگی‌های چشمگیر این لپ تاپ به شمار می‌روند.",
    img: img8,
    like: false,
  },
];

const productSlice = createSlice({
  name: "product",
  initialState,
  reducers: {
    likeToggle: (state, action) => {
      const index = state.findIndex(
        (product) => product.productId === action.payload.productId
      );
      state[index].like = !state[index].like;
      localStorage.setItem("products", JSON.stringify(state));
    },
    // updateProducts: (state, action) => {
    //     localStorage.setItem("products", JSON.stringify(action.payload));
    //     state=[...action.payload];
    // },
  },
});

export default productSlice.reducer;
export const { likeToggle, updateProducts } = productSlice.actions;
