import React from 'react';

const ProductReview = () => {
    return (
        <div>
            <h2 className='text-lg px-4 mb-4'>نقد و بررسی آیفون 15</h2>
            <p className='text-justify px-4'>
            غلب طرفداران گوشی‌های اپل به‌دلیل عمر باتری‌های شگفت‌انگیز آیفون 13 پرومکس و آیفون 14 پرو مکس از این محصولات استفاده می‌کنند. بدین‌ترتیب، عمر باتری آیفون 15 باید حداقل با آیفون 13 پرومکس برابر باشد تا بتواند به یکی از انتخاب‌های خریداران تبدیل شود. همچنین، شرکت اپل از سری آیفون 12 به سمت طراحی لبه‌های مسطح حرکت کرد و در دست نگه‌داشتن گوشی‌های آیفون بسیار دشوار شد. در سری آیفون 15 حدس می‌زنیم که این مشکل برطرف خواهد شد.

از دیگر مشکلات آیفون‌های سری 14 به پایین، تیز بودن لبه‌های آن‌ها است. طبق پیش‌بینی‌ها این مشکل نیز در آیفون 15 برطرف خواهد شد. از دیگر مشکلاتی که کاربران گوشی‌های اپل به آن اشاره کرده‌اند، اندازه کوچک آیفون است. این کاربران عنوان کرده‌اند که استفاده طولانی‌مدت از گوشی‌های کوچک اپل باعث ایجاد درد در ناحیه مچ این افراد شده است. با بزرگتر شدن صفحه نمایش آیفون 15 حدس می‌زنیم رضایت کاربران از این محصول بیشتر شود.

بیشتر بدانید: در رویداد اپل 2023 چه گذشت؟

همچنین، کاربران از وزن زیاد گوشی‌های اپل نیز شکایت کرده‌اند. شرکت اپل با عرضه سری پلاس تلاش کرد وزن گوشی‌های خود را کاهش دهد. اینکه وزن آیفون 15 چقدر خواهد بود، پس از عرضه آن به بازار مشخص خواهد شد. یکی دیگر از دغدغه‌های کاربران آیفون، سیستم نرم‌افزاری آن است. متاسفانه شاهد باگ‌های زیادی در iOS 16 بودیم. این باگ‌ها و مشکلات پس به‌روزرسانی برطرف شدند و امیدواریم iOS 17 بدون هیچ‌گونه مشکل نرم‌افزاری به بازار عرضه شود.

علاوه بر این، کاربران آیفون‌ اعلام کرده‌اند زمانی که در نور روز روی عکس انسان‌ها کلیک می‌کنند، نقاط برجسته آسمان از بین می‌روند. این مشکل هم برای دوربین سلفی و هم برای دوربین عقب وجود دارد. با اضافه شدن سنسورهای جدید به دوربین آیفون 15 امیدواریم این مشکل نیز برطرف شود.
            </p>
        </div>
    );
};

export default ProductReview;